results_595/sglang/minimax-m2.7/1k4k/logs/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc4_1k4k.log
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/MiniMax-M2.7-NVFP4', served_model_name=None, tokenizer=None, num_prompts=40, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=4096, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file='/results/sglang/minimax-m2.7/1k4k/json/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc4_1k4k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/MiniMax-M2.7-NVFP4', served_model_name=None, tokenizer=None, num_prompts=40, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=4096, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file='/results/sglang/minimax-m2.7/1k4k/json/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc4_1k4k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 40960
#Output tokens: 163840
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 40/40 [07:16<00:00, 10.92s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 4         
Successful requests:                     40        
Benchmark duration (s):                  436.81    
Total input tokens:                      40960     
Total input text tokens:                 40960     
Total generated tokens:                  163840    
Total generated tokens (retokenized):    143742    
Request throughput (req/s):              0.09      
Input token throughput (tok/s):          93.77     
Output token throughput (tok/s):         375.08    
Peak output token throughput (tok/s):    380.00    
Peak concurrent requests:                8         
Total token throughput (tok/s):          468.85    
Concurrency:                             4.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   43678.57  
Median E2E Latency (ms):                 43692.27  
P90 E2E Latency (ms):                    43764.44  
P99 E2E Latency (ms):                    43785.54  
---------------Time to First Token----------------
Mean TTFT (ms):                          112.64    
Median TTFT (ms):                        131.84    
P99 TTFT (ms):                           140.80    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          10.64     
Median TPOT (ms):                        10.64     
P99 TPOT (ms):                           10.67     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.68     
Median ITL (ms):                         10.64     
P95 ITL (ms):                            21.26     
P99 ITL (ms):                            21.45     
Max ITL (ms):                            77.57     
==================================================